# Importar librería

In [1]:
import numpy as np
import pandas as pd

# Series

A partir de  listas

In [2]:
l1 = list('abcd')
etiquetas = list(range(1,5))
s1 = pd.Series(l1,etiquetas)
s1

1    a
2    b
3    c
4    d
dtype: object

A partir de arreglos de numpy

In [3]:
arr1 = np.arange(1,5)
s2 = pd.Series(arr1)
s2

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
arr2 = np.arange(5,9)
s3 = pd.Series(arr2)
s3

0    5
1    6
2    7
3    8
dtype: int64

Mientras las series tengan las mismas etiquetas y sean del mismo tamaño, se podrán realizar operaciones entre ellas

In [5]:
s2+s3

0     6
1     8
2    10
3    12
dtype: int64

In [6]:
s2-s3

0   -4
1   -4
2   -4
3   -4
dtype: int64

In [7]:
s2/s3

0    0.200000
1    0.333333
2    0.428571
3    0.500000
dtype: float64

In [8]:
s2**s3

0        1
1       64
2     2187
3    65536
dtype: int64

In [9]:
s3 % s2

0    0
1    0
2    1
3    0
dtype: int64

Y si tienen el tipo de dato adecuado, se pueden pasar a funciones de numpy

In [10]:
np.exp(s2)

0     2.718282
1     7.389056
2    20.085537
3    54.598150
dtype: float64

A partir de diccionarios

In [11]:
midic = {"nombre":"Pepe","apellido":"Botella","edad":33}
s3 = pd.Series(midic)
s3

nombre         Pepe
apellido    Botella
edad             33
dtype: object

# DataFrames

A partir de un arreglo de numpy

In [12]:
arr = np.random.randint(10,100,(3,3))
df1 = pd.DataFrame(arr,list('XYZ'),list('ABC'))
df1

    A   B   C
X  47  57  68
Y  32  19  89
Z  80  24  86

A partir de un diccionario

In [13]:
midic = {
    "uno": pd.Series(np.arange(1,4,dtype=np.float32),list('abc')),
    "dos": pd.Series(np.arange(1,5,dtype=np.float32),list('abcd'))
}
df2 = pd.DataFrame(midic)
df2

   uno  dos
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

# Lectura y edición de datos

In [14]:
df1

    A   B   C
X  47  57  68
Y  32  19  89
Z  80  24  86

Para leer una columna

In [15]:
df1['A']

X    47
Y    32
Z    80
Name: A, dtype: int64

Para leer varias columnas

In [16]:
df1[['A','C']]

    A   C
X  47  68
Y  32  89
Z  80  86

Para leer una fila

In [17]:
df1.loc['X']

A    47
B    57
C    68
Name: X, dtype: int64

Otra forma de leer una fila

In [18]:
df1.iloc[0]

A    47
B    57
C    68
Name: X, dtype: int64

Para leer un elemento

In [19]:
df1['A']['X']

47

In [20]:
df1.loc['X','A']

47

In [21]:
df1.loc[['X','Y'],['C','B']]

    C   B
X  68  57
Y  89  19

Para crear una nueva columna

In [22]:
df1['Suma'] = df1['A']+df1['B']+df1['C']
df1

    A   B   C  Suma
X  47  57  68   172
Y  32  19  89   140
Z  80  24  86   190

Fila nueva a partir de un diccionario.

In [23]:
filanue = dict(zip(list('ABC'),np.random.randint(10,100,3)))
filanue

{'A': 40, 'B': 34, 'C': 22}

In [24]:
df1 = df1.append(pd.Series(filanue,name='W'))
df1

      A     B     C   Suma
X  47.0  57.0  68.0  172.0
Y  32.0  19.0  89.0  140.0
Z  80.0  24.0  86.0  190.0
W  40.0  34.0  22.0    NaN

Para eliminar una columna

In [25]:
df1.drop('Suma',axis=1,inplace=True)
df1

      A     B     C
X  47.0  57.0  68.0
Y  32.0  19.0  89.0
Z  80.0  24.0  86.0
W  40.0  34.0  22.0

Para eliminar una fila

In [26]:
df1.drop('W',axis=0,inplace=True)
df1

      A     B     C
X  47.0  57.0  68.0
Y  32.0  19.0  89.0
Z  80.0  24.0  86.0

# Selección condicional